MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_XCVR_RX_DIG.h
/*
** ###################################################################
**     Processors:          KW45B41Z52AFPA
**                          KW45B41Z52AFTA
**                          KW45B41Z53AFPA
**                          KW45B41Z53AFTA
**                          KW45B41Z82AFPA
**                          KW45B41Z82AFTA
**                          KW45B41Z83AFPA
**                          KW45B41Z83AFPA_NBU
**                          KW45B41Z83AFTA
**                          KW45B41Z83AFTA_NBU
**                          KW45Z41052AFPA
**                          KW45Z41052AFTA
**                          KW45Z41053AFPA
**                          KW45Z41053AFTA
**                          KW45Z41082AFPA
**                          KW45Z41082AFTA
**                          KW45Z41083AFPA
**                          KW45Z41083AFTA
**
**     Version:             rev. 1.0, 2020-05-12
**     Build:               b240715
**
**     Abstract:
**         CMSIS Peripheral Access Layer for XCVR_RX_DIG
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2020-05-12)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file XCVR_RX_DIG.h
 * @version 1.0
 * @2025-05-16 2020-05-12
 * @brief CMSIS Peripheral Access Layer for XCVR_RX_DIG
 *
 * CMSIS Peripheral Access Layer for XCVR_RX_DIG
 */

#if !defined(XCVR_RX_DIG_H_)
#define XCVR_RX_DIG_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_KW45B41Z52AFPA) || defined(CPU_KW45B41Z52AFTA))
#include "KW45B41Z52_COMMON.h"
#elif (defined(CPU_KW45B41Z53AFPA) || defined(CPU_KW45B41Z53AFTA))
#include "KW45B41Z53_COMMON.h"
#elif (defined(CPU_KW45B41Z82AFPA) || defined(CPU_KW45B41Z82AFTA))
#include "KW45B41Z82_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA) || defined(CPU_KW45B41Z83AFTA))
#include "KW45B41Z83_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA_NBU) || defined(CPU_KW45B41Z83AFTA_NBU))
#include "KW45B41Z83_NBU_COMMON.h"
#elif (defined(CPU_KW45Z41052AFPA) || defined(CPU_KW45Z41052AFTA))
#include "KW45Z41052_COMMON.h"
#elif (defined(CPU_KW45Z41053AFPA) || defined(CPU_KW45Z41053AFTA))
#include "KW45Z41053_COMMON.h"
#elif (defined(CPU_KW45Z41082AFPA) || defined(CPU_KW45Z41082AFTA))
#include "KW45Z41082_COMMON.h"
#elif (defined(CPU_KW45Z41083AFPA) || defined(CPU_KW45Z41083AFTA))
#include "KW45Z41083_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- XCVR_RX_DIG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_RX_DIG_Peripheral_Access_Layer XCVR_RX_DIG Peripheral Access Layer
 * @{
 */

/** XCVR_RX_DIG - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL0;                             /**< RXDIG Control 0, offset: 0x0 */
  __IO uint32_t CTRL0_DRS;                         /**< RXDIG Control 0 DRS, offset: 0x4 */
  __IO uint32_t CTRL1;                             /**< RXDIG Control 1, offset: 0x8 */
  __IO uint32_t DFT_CTRL;                          /**< RXDIG DFT Control, offset: 0xC */
  __IO uint32_t RCCAL_CTRL0;                       /**< RCCAL Control 0, offset: 0x10 */
  __IO uint32_t RCCAL_CTRL1;                       /**< RCCAL Control 1, offset: 0x14 */
  __I  uint32_t RCCAL_RES;                         /**< RCCAL Result, offset: 0x18 */
  __IO uint32_t DCOC_CTRL0;                        /**< DCOC Control 0, offset: 0x1C */
  __IO uint32_t DCOC_CTRL0_DRS;                    /**< DCOC Control 0 DRS, offset: 0x20 */
  __IO uint32_t DCOC_CTRL1;                        /**< DCOC CONTROL 1, offset: 0x24 */
  __IO uint32_t DCOC_CTRL2;                        /**< DCOC CONTROL 2, offset: 0x28 */
  __I  uint32_t DCOC_STAT;                         /**< DCOC Status, offset: 0x2C */
  __IO uint32_t IQMC_CTRL0;                        /**< IQ Mismatch Control 0, offset: 0x30 */
  __IO uint32_t IQMC_CTRL1;                        /**< IQ Mismatch Control 1, offset: 0x34 */
  __IO uint32_t ACQ_FILT_0_3;                      /**< Acquisition Filter Coeffs 0~3, offset: 0x38 */
  __IO uint32_t ACQ_FILT_4_7;                      /**< Acquisition Filter Coeffs 4~7, offset: 0x3C */
  __IO uint32_t ACQ_FILT_8_9;                      /**< Acquisition Filter Coeffs 8~9, offset: 0x40 */
  __IO uint32_t ACQ_FILT_10_11;                    /**< Acquisition Filter Coeffs 10~11, offset: 0x44 */
  __IO uint32_t DEMOD_FILT_0_1;                    /**< Demod Filter Coeffs 0~1, offset: 0x48 */
  __IO uint32_t DEMOD_FILT_2_4;                    /**< Demod Filter Coeffs 2~4, offset: 0x4C */
  __IO uint32_t ACQ_FILT_0_3_DRS;                  /**< Acquisition Filter Coeffs 0~3 DRS, offset: 0x50 */
  __IO uint32_t ACQ_FILT_4_7_DRS;                  /**< Acquisition Filter Coeffs 4~7 DRS, offset: 0x54 */
  __IO uint32_t ACQ_FILT_8_9_DRS;                  /**< Acquisition Filter Coeffs 8~9 DRS, offset: 0x58 */
  __IO uint32_t ACQ_FILT_10_11_DRS;                /**< Acquisition Filter Coeffs 10~11 DRS, offset: 0x5C */
  __IO uint32_t DEMOD_FILT_0_1_DRS;                /**< Demod Filter Coeffs 0~1 DRS, offset: 0x60 */
  __IO uint32_t DEMOD_FILT_2_4_DRS;                /**< Demod Filter Coeffs 2~4 DRS, offset: 0x64 */
  __IO uint32_t RSSI_GLOBAL_CTRL;                  /**< RSSI Global Control, offset: 0x68 */
  __IO uint32_t WB_RSSI_CTRL;                      /**< Wide-Band RSSI Control, offset: 0x6C */
  __IO uint32_t WB_RSSI_RES0;                      /**< Wide-Band RSSI Result 0, offset: 0x70 */
  __I  uint32_t WB_RSSI_RES1;                      /**< Wide-Band RSSI Result 1, offset: 0x74 */
  __I  uint32_t WB_RSSI_DFT;                       /**< Wide-Band RSSI DFT Result, offset: 0x78 */
  __IO uint32_t NB_RSSI_CTRL0;                     /**< Narrow-Band RSSI Control 0, offset: 0x7C */
  __IO uint32_t NB_RSSI_CTRL1;                     /**< Narrow-Band RSSI Control 1, offset: 0x80 */
  __IO uint32_t NB_RSSI_RES0;                      /**< Narrow-Band RSSI Result 0, offset: 0x84 */
  __I  uint32_t NB_RSSI_RES1;                      /**< Narrow-Band RSSI Result 1, offset: 0x88 */
  __I  uint32_t NB_RSSI_DFT;                       /**< Narrow-Band RSSI DFT Result, offset: 0x8C */
  __IO uint32_t AGC_CTRL;                          /**< AGC Control, offset: 0x90 */
  __IO uint32_t AGC_CTRL_STAT;                     /**< AGC Control Status, offset: 0x94 */
  __IO uint32_t AGC_TIMING0;                       /**< AGC Timing Control 0, offset: 0x98 */
  __IO uint32_t AGC_TIMING1;                       /**< AGC Timing Control 1, offset: 0x9C */
  __IO uint32_t AGC_TIMING2;                       /**< AGC Timing Control 2, offset: 0xA0 */
  __IO uint32_t AGC_TIMING0_DRS;                   /**< AGC Timing Control 0 DRS, offset: 0xA4 */
  __IO uint32_t AGC_TIMING1_DRS;                   /**< AGC Timing Control 1 DRS, offset: 0xA8 */
  __IO uint32_t AGC_TIMING2_DRS;                   /**< AGC Timing Control 2 DRS, offset: 0xAC */
  __IO uint32_t AGC_IDX11_GAIN_CFG;                /**< AGC IDX11 Gain Config, offset: 0xB0 */
  __IO uint32_t AGC_IDX10_GAIN_CFG;                /**< AGC IDX10 Gain Config, offset: 0xB4 */
  __IO uint32_t AGC_IDX9_GAIN_CFG;                 /**< AGC IDX9 Gain Config, offset: 0xB8 */
  __IO uint32_t AGC_IDX8_GAIN_CFG;                 /**< AGC IDX8 Gain Config, offset: 0xBC */
  __IO uint32_t AGC_IDX7_GAIN_CFG;                 /**< AGC IDX7 Gain Config, offset: 0xC0 */
  __IO uint32_t AGC_IDX6_GAIN_CFG;                 /**< AGC IDX6 Gain Config, offset: 0xC4 */
  __IO uint32_t AGC_IDX5_GAIN_CFG;                 /**< AGC IDX5 Gain Config, offset: 0xC8 */
  __IO uint32_t AGC_IDX4_GAIN_CFG;                 /**< AGC IDX4 Gain Config, offset: 0xCC */
  __IO uint32_t AGC_IDX3_GAIN_CFG;                 /**< AGC IDX3 Gain Config, offset: 0xD0 */
  __IO uint32_t AGC_IDX2_GAIN_CFG;                 /**< AGC IDX2 Gain Config, offset: 0xD4 */
  __IO uint32_t AGC_IDX1_GAIN_CFG;                 /**< AGC IDX1 Gain Config, offset: 0xD8 */
  __IO uint32_t AGC_IDX0_GAIN_CFG;                 /**< AGC IDX0 Gain Config, offset: 0xDC */
  __IO uint32_t AGC_MIS_GAIN_CFG;                  /**< AGC Miscellaneous Gain Config, offset: 0xE0 */
  __IO uint32_t AGC_IDX11_GAIN_VAL;                /**< AGC IDX11 Gain Value, offset: 0xE4 */
  __IO uint32_t AGC_IDX10_GAIN_VAL;                /**< AGC_IDX10_GAIN_VAL, offset: 0xE8 */
  __IO uint32_t AGC_IDX9_GAIN_VAL;                 /**< AGC_IDX9_GAIN_VAL, offset: 0xEC */
  __IO uint32_t AGC_IDX8_GAIN_VAL;                 /**< AGC_IDX8_GAIN_VAL, offset: 0xF0 */
  __IO uint32_t AGC_IDX7_GAIN_VAL;                 /**< AGC_IDX7_GAIN_VAL, offset: 0xF4 */
  __IO uint32_t AGC_IDX6_GAIN_VAL;                 /**< AGC_IDX6_GAIN_VAL, offset: 0xF8 */
  __IO uint32_t AGC_IDX5_GAIN_VAL;                 /**< AGC_IDX5_GAIN_VAL, offset: 0xFC */
  __IO uint32_t AGC_IDX4_GAIN_VAL;                 /**< AGC_IDX4_GAIN_VAL, offset: 0x100 */
  __IO uint32_t AGC_IDX3_GAIN_VAL;                 /**< AGC_IDX3_GAIN_VAL, offset: 0x104 */
  __IO uint32_t AGC_IDX2_GAIN_VAL;                 /**< AGC_IDX2_GAIN_VAL, offset: 0x108 */
  __IO uint32_t AGC_IDX1_GAIN_VAL;                 /**< AGC_IDX1_GAIN_VAL, offset: 0x10C */
  __IO uint32_t AGC_IDX0_GAIN_VAL;                 /**< AGC_IDX0_GAIN_VAL, offset: 0x110 */
  __IO uint32_t AGC_THR_FAST;                      /**< AGC Fast Mode Threshold, offset: 0x114 */
  __IO uint32_t AGC_THR_FAST_DRS;                  /**< AGC Fast Mode Threshold DRS, offset: 0x118 */
  __IO uint32_t AGC_IDX11_THR;                     /**< AGC IDX11 Slow Mode Threshold, offset: 0x11C */
  __IO uint32_t AGC_IDX10_THR;                     /**< AGC IDX10 Slow Mode Threshold, offset: 0x120 */
  __IO uint32_t AGC_IDX9_THR;                      /**< AGC IDX9 Slow Mode Threshold, offset: 0x124 */
  __IO uint32_t AGC_IDX8_THR;                      /**< AGC IDX8 Slow Mode Threshold, offset: 0x128 */
  __IO uint32_t AGC_IDX7_THR;                      /**< AGC IDX7 Slow Mode Threshold, offset: 0x12C */
  __IO uint32_t AGC_IDX6_THR;                      /**< AGC IDX6 Slow Mode Threshold, offset: 0x130 */
  __IO uint32_t AGC_IDX5_THR;                      /**< AGC IDX5 Slow Mode Threshold, offset: 0x134 */
  __IO uint32_t AGC_IDX4_THR;                      /**< AGC IDX4 Slow Mode Threshold, offset: 0x138 */
  __IO uint32_t AGC_IDX3_THR;                      /**< AGC IDX3 Slow Mode Threshold, offset: 0x13C */
  __IO uint32_t AGC_IDX2_THR;                      /**< AGC IDX2 Slow Mode Threshold, offset: 0x140 */
  __IO uint32_t AGC_IDX1_THR;                      /**< AGC IDX1 Slow Mode Threshold, offset: 0x144 */
  __IO uint32_t AGC_IDX0_THR;                      /**< AGC IDX0 Slow Mode Threshold, offset: 0x148 */
  __IO uint32_t AGC_THR_MIS;                       /**< AGC Miscellaneous Thresholds, offset: 0x14C */
  __IO uint32_t AGC_OVRD;                          /**< AGC Override Control, offset: 0x150 */
  __IO uint32_t DC_RESID_CTRL;                     /**< DC Residual Control, offset: 0x154 */
  __IO uint32_t DC_RESID_CTRL2;                    /**< DC Residual Control2, offset: 0x158 */
  __IO uint32_t DC_RESID_CTRL_DRS;                 /**< DC Residual Control DataRate1, offset: 0x15C */
  __I  uint32_t DC_RESID_EST;                      /**< DC Residual Estimate, offset: 0x160 */
  __IO uint32_t DFT_TONE_ANALYZER0;                /**< DfT tone analyzer, offset: 0x164 */
  __IO uint32_t DFT_TONE_ANALYZER1;                /**< DfT tone analyzer, offset: 0x168 */
  __I  uint32_t DFT_TONE_ANALYZER2;                /**< DfT tone analyzer, offset: 0x16C */
  __IO uint32_t DFT_TONE_ANALYZER3;                /**< DfT tone analyzer, offset: 0x170 */
  __I  uint32_t DCOC_DIG_CORR_RESULT;              /**< DCOC Digital Correction Result, offset: 0x174 */
} XCVR_RX_DIG_Type;

/* ----------------------------------------------------------------------------
   -- XCVR_RX_DIG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_RX_DIG_Register_Masks XCVR_RX_DIG Register Masks
 * @{
 */

/*! @name CTRL0 - RXDIG Control 0 */
/*! @{ */

#define XCVR_RX_DIG_CTRL0_ADC_CLIP_EN_MASK       (0x1U)
#define XCVR_RX_DIG_CTRL0_ADC_CLIP_EN_SHIFT      (0U)
/*! ADC_CLIP_EN - ADC Output Clip Enable
 *  0b0..ADC clip is disabled.
 *  0b1..ADC clip is enabled.
 */
#define XCVR_RX_DIG_CTRL0_ADC_CLIP_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL0_ADC_CLIP_EN_SHIFT)) & XCVR_RX_DIG_CTRL0_ADC_CLIP_EN_MASK)

